src/test/resources/jp/pay/model/charge.json

{
  "amount": 3500,
  "amount_refunded": 0,
  "captured": true,
  "captured_at": 1578372537,
  "card": {
    "address_city": null,
    "address_line1": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": "unchecked",
    "brand": "Visa",
    "country": null,
    "created": 1578372537,
    "customer": null,
    "cvc_check": "unchecked",
    "exp_month": 2,
    "exp_year": 2020,
    "fingerprint": "e1d8225886e3a7211127df751c86787f",
    "id": "car_d0e44730f83b0a19ba6caee04160",
    "last4": "4242",
    "name": null,
    "object": "card"
  },
  "created": 1578372537,
  "currency": "jpy",
  "customer": null,
  "description": "test charge",
  "expired_at": null,
  "failure_code": null,
  "failure_message": null,
  "fee_rate": "3.00",
  "id": "ch_fa990a4c10672a93053a774730b0a",
  "livemode": false,
  "metadata": null,
  "object": "charge",
  "paid": true,
  "platform_fee": null,
  "platform_fee_rate": "10.00",
  "refund_reason": null,
  "refunded": false,
  "subscription": null,
  "tenant": "ten_121673955bd7aa144de5a8f6c262",
  "total_platform_fee": 350,
  "three_d_secure_status": "attempt",
  "term_id": "tm_b92b879e60f62b532d6756ae12cc"
}